OpenFOAM-3.0.0/tutorials/compressible/sonicFoam/ras/nacaAirfoil/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication star3ToFoam prostar/nacaAirfoil

mv constant/polyMesh/boundary temp
sed -e s/"\([\t ]*type[\t ]*\)symmetryPlane"/"\1empty"/g \
    temp > constant/polyMesh/boundary
rm temp

runApplication $application

# ----------------------------------------------------------------- end-of-file
